/**HEADER********************************************************************
* 
* Copyright (c) 2008 Freescale Semiconductor;
* All Rights Reserved                       
*
* Copyright (c) 1989-2008 ARC International;
* All Rights Reserved
*
*************************************************************************** 
*
* THIS SOFTWARE IS PROVIDED BY FREESCALE "AS IS" AND ANY EXPRESSED OR 
* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES 
* OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  
* IN NO EVENT SHALL FREESCALE OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
* INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES 
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR 
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) 
* HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, 
* STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING 
* IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF 
* THE POSSIBILITY OF SUCH DAMAGE.
*
**************************************************************************
*
* $FileName: mcf51ac.h$
* $Version : 3.6.1.0$
* $Date    : May-18-2010$
*
* Comments:
*
*   This file contains the type definitions for the mcf5225x processors.
*
*END************************************************************************/

#ifndef __mcf51ac_h__
#define __mcf51ac_h__


/*------------------------------------------------------------------------*/
/*
** MCG registers - multi clock generator
*/


#define MCF51XX_MCGC1_IREFSTEN_MASK             1
#define MCF51XX_MCGC1_IRCLKEN_MASK              2
#define MCF51XX_MCGC1_IREFS_MASK                4
#define MCF51XX_MCGC1_RDIV0_MASK                8
#define MCF51XX_MCGC1_RDIV1_MASK                16
#define MCF51XX_MCGC1_RDIV2_MASK                32
#define MCF51XX_MCGC1_CLKS0_MASK                64
#define MCF51XX_MCGC1_CLKS1_MASK                128
#define MCF51XX_MCGC1_RDIV_MASK                 56
#define MCF51XX_MCGC1_RDIV_BITNUM               3
#define MCF51XX_MCGC1_CLKS_MASK                 192
#define MCF51XX_MCGC1_CLKS_BITNUM               6

#define MCF51XX_MCGSC_FTRIM_MASK                1
#define MCF51XX_MCGSC_OSCINIT_MASK              2
#define MCF51XX_MCGSC_CLKST0_MASK               4
#define MCF51XX_MCGSC_CLKST1_MASK               8
#define MCF51XX_MCGSC_IREFST_MASK               16
#define MCF51XX_MCGSC_PLLST_MASK                32
#define MCF51XX_MCGSC_LOCK_MASK                 64
#define MCF51XX_MCGSC_LOLS_MASK                 128
#define MCF51XX_MCGSC_CLKST_MASK                12
#define MCF51XX_MCGSC_CLKST_BITNUM              2

#define MCF51XX_MCGC4_DRST_DRS0_MASK            1
#define MCF51XX_MCGC4_DRST_DRS1_MASK            2
#define MCF51XX_MCGC4_DMX32_MASK                32
#define MCF51XX_MCGC4_DRST_DRS_MASK             3
#define MCF51XX_MCGC4_DRST_DRS_BITNUM           0

#define MCF51XX_MCGC2_EREFSTEN_MASK             1
#define MCF51XX_MCGC2_ERCLKEN_MASK              2
#define MCF51XX_MCGC2_EREFS_MASK                4
#define MCF51XX_MCGC2_LP_MASK                   8
#define MCF51XX_MCGC2_HGO_MASK                  16
#define MCF51XX_MCGC2_RANGE_MASK                32
#define MCF51XX_MCGC2_BDIV0_MASK                64
#define MCF51XX_MCGC2_BDIV1_MASK                128
#define MCF51XX_MCGC2_BDIV_MASK                 192
#define MCF51XX_MCGC2_BDIV_BITNUM               6

#define MCF51XX_MCGC3_VDIV0_MASK                1
#define MCF51XX_MCGC3_VDIV1_MASK                2
#define MCF51XX_MCGC3_VDIV2_MASK                4
#define MCF51XX_MCGC3_VDIV3_MASK                8
#define MCF51XX_MCGC3_DIV32_MASK                16
#define MCF51XX_MCGC3_CME_MASK                  32
#define MCF51XX_MCGC3_PLLS_MASK                 64
#define MCF51XX_MCGC3_LOLIE_MASK                128
#define MCF51XX_MCGC3_VDIV_MASK                 15
#define MCF51XX_MCGC3_VDIV_BITNUM               0


#define MCF51XX_SOPT2_BIG_END                   0x20

/*------------------------------------------------------------------------*/
/*
**                      TYPE DEFINITIONS
*/

/*
** MCF51AC_ftm_struct
** This structure defines FTM registers
*/ 

typedef enum {
    FTM_CHANNEL_0 = 0,
    FTM_CHANNEL_1,
    FTM_CHANNEL_2,
    FTM_CHANNEL_3,
    FTM_CHANNEL_4,
    FTM_CHANNEL_5,
    FTM_CHANNEL_MAX
} ftm_channel_t;

typedef struct _ftm_channel_struct
{
    uint_8  FTMxCySC;           /* FTM Status and Control                           */
    uint_16 FTMxCyV;            /* FTM Channel Value                                */
} FTM_CHANNEL_STRUCT, _PTR_ FTM_CHANNEL_STRUCT_PTR;

typedef struct MCF51AC_ftm_struct
{
    uint_8  FTMxSC;             /* FTM Status and Control                           */
    uint_16 FTMxCNT;            /* FTM Counter Register                             */
    uint_16 FTMxMOD;            /* FTM Counter Modulo                               */
    FTM_CHANNEL_STRUCT FTMxC[FTM_CHANNEL_MAX];  /* FTM Channel Structure            */   
    FTM_CHANNEL_STRUCT FTMxC_reserved[2];
    uint_16 FTMxCNTIN;          /* FTM Counter Initial Value                        */
    uint_8  FTMxSTATUS;         /* FTM Capture and Compare Status                   */
    uint_8  FTMxMODE;           /* FTM Features Mode Selection                      */
    uint_8  FTMxSYNC;           /* FTM Synchronization                              */
    uint_8  FTMxOUTINIT;        /* FTM Initial State for Channels Output            */
    uint_8  FTMxOUTMASK;        /* FTM Output Mask                                  */
    uint_8  FTMxCOMBINE[FTM_CHANNEL_MAX / 2]; /* FTM Function For Linked Channels   */
    uint_8  FTMxCOMBINE_reserved[1];          /* FTM Function For Linked Channels   */
    uint_8  FTMxDEADTIME;       /* FTM Deadtime Insertion Control                   */
    uint_8  FTMxEXTTRIG;        /* FTM External Trigger                             */
    uint_8  FTMxPOL;            /* FTM Channels Polarity                            */
    uint_8  FTMxFMS;            /* FTM Fault Mode Status                            */
    uint_8  FTMxFILTER[2];      /* FTM Input Capture Filter Control                 */
    uint_8  FTMxFLTFILTER;      /* FTM Fault Input Filter Control                   */
    uint_8  FTMxRFU;            /* FTM Register for Future Use                      */
} MCF51AC_FTM_STRUCT, _PTR_ MCF51AC_FTM_STRUCT_PTR;
typedef volatile struct MCF51AC_ftm_struct _PTR_ VMCF51AC_FTM_STRUCT_PTR;

/*
** MCF51AC_can_struct
** This structure defines CAN registers
*/ 
typedef struct MCF51AC_can_struct
{
    uint_8 CANCTL0;
    uint_8 CANCTL1;
    uint_8 CANBTR0;
    uint_8 CANBTR1;
    uint_8 CANRFLG;
    uint_8 CANRIER;
    uint_8 CANTFLG;
    uint_8 CANTIER;
    uint_8 CANTARQ;
    uint_8 CANTAAK;
    uint_8 CANTBSEL;
    uint_8 CANIDAC;
    uint_8 reserved01;
    uint_8 CANMISC;
    uint_8 CANRXERR;
    uint_8 CANTXERR;
    uint_8 CANIDAR0;
    uint_8 CANIDAR1;
    uint_8 CANIDAR2;
    uint_8 CANIDAR3;
    uint_8 CANIDMR0;
    uint_8 CANIDMR1;
    uint_8 CANIDMR2;
    uint_8 CANIDMR3;
    uint_8 CANIDAR4;
    uint_8 CANIDAR5;
    uint_8 CANIDAR6;
    uint_8 CANIDAR7;
    uint_8 CANIDMR4;
    uint_8 CANIDMR5;
    uint_8 CANIDMR6;
    uint_8 CANIDMR7;
    uint_8 MSCAN_RX_BUF[0x10];
    uint_8 MSCAN_TX_BUF[0x10];
} MCF51AC_CAN_STRUCT, _PTR_ MCF51AC_CAN_STRUCT_PTR;
typedef volatile struct MCF51AC_can_struct _PTR_ VMCF51AC_CAN_STRUCT_PTR;

/* This structure defines (Rapid) General Purpose I/O registers (APPROACH #2) */

typedef enum {
    GPIO_PORT_A = 0,
    GPIO_PORT_B,
    GPIO_PORT_C,
    GPIO_PORT_D,
    GPIO_PORT_E,
    GPIO_PORT_F,
    GPIO_PORT_G,
    GPIO_PORT_H,
    GPIO_PORT_J,
    GPIO_PORT_MAX
} gpio_port_t;

typedef struct MCF51AC_gpio_data_struct
{
   uint_8  PTxD;      /*** Port Data ***/
   uint_8  PTxDD;     /*** Port Data Direction ***/
} MCF51AC_GPIO_DATA_STRUCT, _PTR_ MCF51AC_GPIO_DATA_STRUCT_PTR;
typedef volatile struct MCF51AC_gpio_data_struct _PTR_ VMCF51AC_GPIO_DATA_STRUCT_PTR;

typedef struct MCF51AC_gpio_struct
{
   uint_8  PTxPE;     /*** Port Pull-Up Enable ***/
   uint_8  PTxSE;     /*** Port Slew Rate Control ***/
   uint_8  PTxDS;     /*** Port Drive Strength Control ***/
   uint_8  reserved01;
} MCF51AC_GPIO_STRUCT, _PTR_ MCF51AC_GPIO_STRUCT_PTR;
typedef volatile struct MCF51AC_gpio_struct _PTR_ VMCF51AC_GPIO_STRUCT_PTR;

/*
** MCF51AC_irq_struct
** This structure defines Interrupt registers
*/
typedef struct MCF51AC_irq_struct
{
  uint_8  IRQSC;       /*** IRQSC - Interrupt Pin Request Status and Control Register; 0xFFFF80E0 ***/
} MCF51AC_IRQ_STRUCT, _PTR_ MCF51AC_IRQ_STRUCT_PTR;
typedef volatile struct MCF51AC_irq_struct _PTR_ VMCF51AC_IRQ_STRUCT_PTR;

/*
** MCF51AC_crc_struct
** This structure defines CRC registers
*/
typedef struct MCF51AC_crc_struct
{
  uint_8 CRCH;
  uint_8 CRCL;
} MCF51AC_CRC_STRUCT, _PTR_ MCF51AC_CRC_STRUCT_PTR;
typedef volatile struct MCF51AC_crc_struct _PTR_ VMCF51AC_CRC_STRUCT_PTR;

typedef struct MCF51AC_tpm_channel_struct
{
  uint_8    TPMxCySC;
  uint_16  TPMxCyV; //TPMxCyVH and TPMxCyVL registers
} MCF51AC_TPM_CHANNEL_STRUCT, _PTR_ MCF51AC_TPM_CHANNEL_STRUCT_PTR;
typedef volatile struct MCF51AC_tpm_channel_struct _PTR_ VMCF51AC_TPM_CHANNEL_STRUCT_PTR;

typedef struct MCF51AC_tpm_struct
{
  uint_8   TPMxSC; 
  uint_16  TPMxCNT;  //TPMxCNTH and TPMxCNTL registers
  uint_16  TPMxMOD;  //TPMxMODH and TPMxMODL registers
  MCF51AC_TPM_CHANNEL_STRUCT TPMxC[2];
} MCF51AC_TPM_STRUCT, _PTR_ MCF51AC_TPM_STRUCT_PTR;
typedef volatile struct MCF51AC_tpm_struct _PTR_ VMCF51AC_TPM_STRUCT_PTR;

/*
** MCF51AC_kbi_struct
** This structure defines Interrupt registers
*/

typedef struct MCF51AC_kbi_struct
{
  uint_8  KBIxSC;       /*** IRQSC - Interrupt Pin Request Status and Control Register; 0xFFFF80E0 ***/
  uint_8  KBIxPE;       /*** IRQSC - Interrupt Pin Request Status and Control Register; 0xFFFF80E0 ***/
} MCF51AC_KBI_STRUCT, _PTR_ MCF51AC_KBI_STRUCT_PTR;
typedef volatile struct MCF51AC_kbi_struct _PTR_ VMCF51AC_KBI_STRUCT_PTR;


/*
** MCF51AC_MCG_STRUCT
** Multi clock generator module
*/
typedef struct MCF51AC_mcg_struct
{
  uint_8 MCGC1;  /*** MCGC1 - MCG Control Register 1; 0xFFFF8048 ***/
  uint_8 MCGC2;  /*** MCGC2 - MCG Control Register 2; 0xFFFF8049 ***/
  uint_8 MCGTRM; /*** MCGTRM - MCG Trim Register; 0xFFFF804A ***/
  uint_8 MCGSC;  /*** MCGSC - MCG Status and Control Register; 0xFFFF804B ***/
  uint_8 MCGC3;  /*** MCGC3 - MCG Control Register 3; 0xFFFF804C ***/
  uint_8 MCGC4;  /*** MCGC4 - MCG Control Register 4; 0xFFFF804D ***/
  uint_8 reserved01; /*** MCGT - MCG Test Register; 0xFFFF804E; reserved for factory use ***/ 
} MCF51AC_MCG_STRUCT, _PTR_ MCF51AC_MCG_STRUCT_PTR;
typedef volatile struct MCF51AC_mcg_struct _PTR_ VMCF51AC_MCG_STRUCT_PTR;

/*
** MCF51AC_sim_struct
** This structure defines System Integration Module registers
*/
typedef struct MCF51AC_sim_struct
{
   uint_8 SRS;
   uint_8 reserved01;
   uint_8 SOPT;
   uint_8 SMCLK;
   uint_8 reserved02[2];
   uint_8 SDIDH;
   uint_8 SDIDL;
   uint_8 SRTISC;
   uint_8 SPMSC1;
   uint_8 SPMSC2;
   uint_8 reserved03;
   uint_8 SOPT2;
   uint_8 SCGC1;
   uint_8 SCGC2;
}MCF51AC_SIM_STRUCT, _PTR_ MCF51AC_SIM_STRUCT_PTR;
typedef volatile struct MCF51AC_sim_struct _PTR_ VMCF51AC_SIM_STRUCT_PTR;

typedef struct MCF51AC_acpm_struct
{
   uint_8 ACPMxSC;
} MCF51AC_ACPM_STRUCT, _PTR_ MCF51AC_ACPM_STRUCT_PTR;
typedef volatile struct MCF51AC_acpm_struct _PTR_ VMCF51AC_ACPM_STRUCT_PTR;

#define ALIGN_TO(x) (x)
#define USE_REFERENCE(x) -sizeof(x)
#define AT_ADDRESS(x)   -x
typedef struct MCF51AC_struct
{   
    MCF51AC_GPIO_DATA_STRUCT GPIO_A;        /* 0x8000 - 0x800F */
    MCF51AC_GPIO_DATA_STRUCT GPIO_B;
    MCF51AC_GPIO_DATA_STRUCT GPIO_C;
    MCF51AC_GPIO_DATA_STRUCT GPIO_D;
    MCF51AC_GPIO_DATA_STRUCT GPIO_E;
    MCF51AC_GPIO_DATA_STRUCT GPIO_F;
    MCF51AC_GPIO_DATA_STRUCT GPIO_G;
    MCF51AC_GPIO_DATA_STRUCT GPIO_H;   
    MCF51AC_ADC_STRUCT       ADC;           /* 0x8010 - 0x8019 */ 
    MCF51AC_GPIO_DATA_STRUCT GPIO_J;        /* 0x801A - 0x801B */   
    MCF51AC_IRQ_STRUCT       IRQ;           /* 0x801C */
    uint_8 reserved01[0x801E - 0x801C - sizeof(MCF51AC_IRQ_STRUCT)];   
    MCF51AC_KBI_STRUCT       KBI;           /* 0x801E - 0x801F */
    uint_8 reserved02[0x8038-0x801E - sizeof(MCF51AC_KBI_STRUCT)];   
    MCF51XX_SCI_STRUCT       SCI1;          /* 0x8038 - 0x8047 */
    MCF51XX_SCI_STRUCT       SCI2;   
    MCF51AC_MCG_STRUCT       MCG;           /* 0x8048 - 0x804E */   
    uint_8 reserved03[0x8050 - 0x8048 - sizeof(MCF51AC_MCG_STRUCT)];
    MCF5XXX_SPI8_STRUCT      SPI1;          /* 0x8050 - 0x8055 */
    uint_8 reserved04[ 0x8058 - 0x8050 - sizeof(MCF5XXX_SPI8_STRUCT)];   
    MCF51AC_I2C_STRUCT       I2C1;          /* 0x8058 - 0x805D */
    MCF51AC_ACPM_STRUCT      ACMP1;         /* 0x805E */
    MCF51AC_ACPM_STRUCT      ACMP2;         /* 0x805F */
    uint_8 reserved05[0x8080-0x805F - sizeof(MCF51AC_ACPM_STRUCT)];
    MCF51AC_FTM_STRUCT       FTM1;          /* 0x8080 - 0x80AD */
    uint_8 reserved06[0x80C0- 0x8080 - sizeof(MCF51AC_FTM_STRUCT)];
    MCF51AC_FTM_STRUCT       FTM2;          /* 0x80C0 - 0x80ED */
    uint_8 reserved07[0x9800-0x80C0 - sizeof(MCF51AC_FTM_STRUCT)];  
    MCF51AC_SIM_STRUCT       SIM;           /* 0x9800 - 0x980E */
    uint_8 reserved08[0x9820-0x9800 - sizeof(MCF51AC_SIM_STRUCT)];
    MCF51XX_FTSR_STRUCT      FTSR;          /* 0x9820 - 0x9826 */
    MCF51AC_TPM_STRUCT       TPM3;          /* 0x9830 - 0x983A */
    uint_8 reserved10[0x9840 - 0x9830 - sizeof(MCF51AC_TPM_STRUCT)];
    MCF51AC_GPIO_STRUCT      GPIO_SET_A;
    MCF51AC_GPIO_STRUCT      GPIO_SET_B;
    MCF51AC_GPIO_STRUCT      GPIO_SET_C;
    MCF51AC_GPIO_STRUCT      GPIO_SET_D;
    MCF51AC_GPIO_STRUCT      GPIO_SET_E;
    MCF51AC_GPIO_STRUCT      GPIO_SET_F;
    MCF51AC_GPIO_STRUCT      GPIO_SET_G;
    MCF51AC_GPIO_STRUCT      GPIO_SET_H; 
    MCF51AC_GPIO_STRUCT      GPIO_SET_J;   
    uint_8 reserved11[0x9868 - 0x9840 -(sizeof(MCF51AC_GPIO_STRUCT) * GPIO_PORT_MAX )];
    MCF5XXX_SPI16_STRUCT     SPI2;
    uint_8 reserved12[0x9880 - 0x9868 - sizeof(MCF5XXX_SPI16_STRUCT)];
    MCF51AC_CAN_STRUCT       CAN;
    MCF51AC_CRC_STRUCT       CRC;
    uint_8 reserved0B[2];
    uint_8 CRCL[4];
    uint_8 reserved0C[0x98CF-0x98C7];
} MCF51AC_STRUCT, _PTR_ MCF51AC_STRUCT_PTR;
typedef volatile struct MCF51AC_struct _PTR_ VMCF51AC_STRUCT_PTR;


/*
